** TOP 25 pandas tricks **

https://github.com/justmarkham/pandas-videos/blob/master/top_25_pandas_tricks.ipynb

In [13]:
import pandas as pd
import numpy as np

In [12]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

C:\Users\victor.goncalves\AppData\Local\Temp\ipykernel_16248\3279769219.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')

### 1 Show installed versions

In [4]:
pd.__version__
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : e8093ba372f9adfe79439d90fe74b0b5b6dea9d6
python           : 3.10.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19044
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 10, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : pt_BR.cp1252

pandas           : 1.4.3
numpy            : 1.23.0
pytz             : 2022.1
dateutil         : 2.8.2
setuptools       : 58.1.0
pip              : 22.0.4
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : None
IPython          : 8.4.0
pandas_datareader: None
bs4              : None
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
markupsafe       : None
matplotlib       : None
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

### 2. Create Data Frame

In [27]:
df = pd.DataFrame({'col one':[10,25,50,90],'col two':[20,34,56,92],'col three':[55,14,54,90]})
df.head()
df.dtypes

col one      int64
col two      int64
col three    int64
dtype: object

In [18]:
# A LOT OF DATA
df1 = pd.DataFrame(np.random.rand(4,8), columns = list('abcdefgh'))
df.head()

,a,b,c,d,e,f,g,h
0,0.825777,0.712283,0.106604,0.811648,0.044510,0.602589,0.866096,0.289322
1,0.165539,0.429327,0.098886,0.899424,0.202416,0.291509,0.787824,0.387681
2,0.066427,0.667839,0.271889,0.106094,0.883848,0.682643,0.680420,0.774832
3,0.488026,0.071611,0.440700,0.903836,0.142406,0.167519,0.776512,0.879156

### 3. Rename columns

In [26]:
df = df.rename({'col one':'col_one', 'col two':'col_two', 'col three':'col_three'}, axis='columns')
df.columns

Index(['col_one1', 'col_two2', 'col_three'], dtype='object')

In [25]:
# OVERWRITE
df.columns = ['col_one1','col_two2','col_three']
df

   col_one1  col_two2  col_three
0        10        20         55
1        25        34         14
2        50        56         54
3        90        92         90

In [28]:
df.columns = df.columns.str.replace(' ','_')
df

   col_one  col_two  col_three
0       10       20         55
1       25       34         14
2       50       56         54
3       90       92         90

### 4. Reverse row order

In [32]:
drinks.loc[::-1].head()

# RESET Index

drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

### 5. Reverse column order

In [34]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [36]:
drinks.loc[:,::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

### 6. Select columns by data type

In [37]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [38]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

### 7. Convert strings to numbers

In [63]:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [57]:
df = df.astype({'col_one':'float','col_two':'float'})
df.dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

However, this would have resulted in an error if you tried to use it on the third column, because that column contains a dash to represent zero and pandas doesn't understand how to handle it.

Instead, you can use the to_numeric() function on the third column and tell it to convert any invalid input into NaN values:

If 'raise', then invalid parsing will raise an exception.

If 'coerce', then invalid parsing will be set as NaN.

In [60]:
#Modificar para Float
df.col_three = pd.to_numeric(df.col_three, errors= 'coerce')
#Substituir NaN por 0 - zero
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

In [64]:
# Aplicando em todas de uma so vez
df = df.apply(pd.to_numeric, errors = 'coerce').fillna(0)

### 8.Filter a DataFrame by multiple categories

In [68]:
# UNIQUE GENRE
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [75]:
# FILTER
movies[movies.genre == 'Crime'].head()

TypeError: Cannot perform 'ror_' with a dtyped [float64] array and scalar of type [bool]